app/controllers/chargingstations_controller.rb

SELECT "chargingstations".* FROM "chargingstations"
---
    def index
        @chargingstations = Chargingstation.all

SELECT "chargingstations".* FROM "chargingstations" WHERE "chargingstations"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def show
        @chargingstation = Chargingstation.find(params[:id])